# Exercise 4.5

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Importing 'Products' from the 'Original data' folder AND 'Orders wrangled' from the 'Prepared data' folder
path = r'C:\Users\andd0\Documents\InstaCart Basket Analysis'

In [3]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

#### Fixing some issues with the price of two products:

#### First product

In [5]:
df_prods['prices'].max()

99999.0

In [6]:
# Finding out the ID of the product whose price is 99,999
df_prods[df_prods['prices'] == df_prods['prices'].max()]

       product_id           product_name  aisle_id  department_id   prices
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

In [7]:
# Fixing the price of '2 % Reduced Fat Milk' from 99,999 to 3.32 (cost of a similar product in Walmart)
df_prods.loc[df_prods['product_id'] == 33664, 'prices'] = 3.32

In [8]:
# Checking whether the change was successful
df_prods.loc[df_prods['product_id'] == 33664]

       product_id           product_name  aisle_id  department_id  prices
33666       33664  2 % Reduced Fat  Milk        84             16    3.32

#### Second product

In [9]:
df_prods['prices'].max()

14900.0

In [10]:
# Finding out the ID of the product whose price is 14,900
df_prods[df_prods['prices'] == df_prods['prices'].max()]

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0

In [11]:
# Fixing the price of 'Lowfat 2% Milkfat Cottage Cheese' from 14,900 to 3.94 (cost of a similar product in Walmart)
df_prods.loc[df_prods['product_id'] == 21553, 'prices'] = 3.94

In [12]:
# Checking whether the change was successful
df_prods.loc[df_prods['product_id'] == 21553]

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,3.94

In [13]:
# Descriptive stats
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      7.682105
std    14343.717401     38.316774       5.850282      4.200237
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000     25.000000

### Mixed-type data

In [14]:
# Create a dataframe
df_test = pd.DataFrame()

In [15]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [16]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [17]:
# For loop for checking whether a dataframe contains any mixed-type columns
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\4252316668.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [18]:
# The output is the 'mix' column printed, meaning that it contains mixed-type data.

In [19]:
# This line of code will unify the data types in this column; all will be changed to strings
df_test['mix'] = df_test['mix'].astype('str')

In [20]:
# In Python, object = string
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

### Missing values

In [21]:
# What does this line of code do? It assigns the function isnull() to the df_prods dataframe, then sums the result with the attached sum() function.
# In simpler words: it finds missing values and adds them up.
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [22]:
# How to view these 16 missing values from the product_name column?
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [23]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [24]:
# How to address these missing values?
# Dropping missing values

df_prods.shape

(49693, 5)

In [25]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [26]:
df_prods_clean.shape

(49677, 5)

### Duplicates

In [27]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [28]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [29]:
# The output shows 5 duplicates
# How to address them? This time we're dropping them
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [30]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

## Step No. 2

#### Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [31]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [32]:
# This line of code will pair 'order_number = 1' with 'days_since_prior_order'. Let's see what the output is.
df_ords[df_ords['order_number'] == 1][['order_number', 'days_since_prior_order']].value_counts(dropna=False)

order_number  days_since_prior_order
1             NaN                       206209
Name: count, dtype: int64

In [33]:
# Output: 'order_number = 1' - 'days_since_prior_order = NaN' - 206,209 entries
# Meaning: 206,209 first-time orders paired with 'days_since_prior_order = NaN'

#### Another view:

In [34]:
df_ords[df_ords['order_number'] == 1][['order_number', 'days_since_prior_order']]

         order_number  days_since_prior_order
0                   1                     NaN
11                  1                     NaN
26                  1                     NaN
39                  1                     NaN
45                  1                     NaN
...               ...                     ...
3420930             1                     NaN
3420934             1                     NaN
3421002             1                     NaN
3421019             1                     NaN
3421069             1                     NaN

[206209 rows x 2 columns]

#### Answer to question/step No. 2:

#### The values seem consistent with expectations for an online app. For instance:

#### 1) Orders placed between 23:00 - 06:00 (I'd say not many physical stores are open during this time frame) are not inconsistent, given the 24/7 availability of the app.
#### 2) The column 'days_since_prior_order' shows a mean = 11 days and a max = 30. These numbers aren't suspicious either, as the purchasing habits of users may vary depending on how many items they purchase in one single visit, whether they visit other stores (online or not), etc.
#### 3) All 'order_number = 1' (total = 206,209) are paired with 'days_since_prior_order = NaN', as expected. If 'days_since_prior_order' were equal to 0, that would create some confusion, as "placing the first order 0 days after the previous order" makes no sense.

#### What I believe should be investigated further:

#### The 'max' value under 'order_number' is 100. 

#### What questions does that raise?

#### - Is that a default limit that no user has reached yet?
#### - Will it change automatically once users place more than 100 orders?

## Step No. 3

#### Check for mixed-type data in your df_ords dataframe.

In [35]:
# For loop for checking whether a dataframe contains any mixed-type columns
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\andd0\AppData\Local\Temp\ipykernel_15988\3862466107.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)

## Step No. 4

#### If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [36]:
# No column names were printed, which means that the for loop found no mixed-type columns.

## Step No. 5

#### Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [37]:
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

#### No columns with missing values except for one: days_since_prior_order = 206,209 NaN
#### EXPLANATION: All 'order_number = 1' (total = 206,209) are paired with 'days_since_prior_order = NaN'; otherwise, if 'days_since_prior_order' were equal to 0, that would create some confusion, as "placing the first order 0 days after the previous order" makes no sense. So, the first order should be paired with 'days_since_prior_order = NaN'.

## Step No. 6

#### Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice.

#### Answer: I will create a new variable that acts like a flag based on the missing value. Why? Because NaN values are important within this context, no days have passed before the first order; therefore, NaN works fine here.

In [38]:
# I will add a new column to the dataframe to categorize whether the record is a "first order" or not.
df_ords['first_order'] = np.where(df_ords['days_since_prior_order'].isna(), 'Yes', 'No')

In [39]:
df_ords.head(10)

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,prior,1,2,8,NaN,Yes
1,1,2398795,1,prior,2,3,7,15.0,No
2,2,473747,1,prior,3,3,12,21.0,No
3,3,2254736,1,prior,4,4,7,29.0,No
4,4,431534,1,prior,5,4,15,28.0,No
5,5,3367565,1,prior,6,2,7,19.0,No
6,6,550135,1,prior,7,1,9,20.0,No
7,7,3108588,1,prior,8,1,14,14.0,No
8,8,2295261,1,prior,9,1,16,0.0,No
9,9,2550362,1,prior,10,4,8,30.0,No

## Step No. 7

#### Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [40]:
df_dups = df_ords[df_ords.duplicated()]

In [41]:
df_dups.head()

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

## Step No. 8

#### Address the duplicates using an appropriate method. In a markdown cell, explain why you used your method of choice.

In [42]:
# No duplicates found

In [46]:
df_ords.shape

(3421083, 9)

## Step No. 9

#### Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [43]:
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'ords_wrangled_Ex4_5.csv'))

In [44]:
df_prods.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods__wrangled_Ex4_5.csv'))